[{"title":"好用的Minecraft启动器","path":"2021/10/06/mc启动器/","text":"最近有个朋友问了我一些Minecraft启动器的问题，我决定写篇文章推荐几款Minecraft启动器 🐷提醒玩盗版不可耻，这是在被逼无奈后的艰难选择。 请有能力后支持正版Minecraft 👴启动器元老：HMCLHMCL全名：Hello Minecraft! Launcher 拥有六年历史。因为是Java语言开发，所以它有多系统支持。 一键创建游戏并安装 Fabric、Forge、LiteLoader、OptiFine 支持多线程（速度非常快） 开源、开放、自由 它们的官网不太稳定，这里贴一个Windows端稳定版的下载链接（密码5267） 👦后起之秀：PCL 2全名Plain Craft Launcher 2！（有种对标HMCL的感觉，哈哈） 可能是目前最受欢迎的启动器 支持盗版一键联机 支持多线程（速度非常快） 一键创建游戏并安装 Fabric、Forge、LiteLoader、OptiFine 更加人性化的设置 流畅的动画设计 一键下载模组 👩时尚花哨：Bakaxl官方介绍：脑子有洞的新一代Minecraft崩坏启动器 最漂亮的启动器 支持盗版一键联机 笨蛋广场 一键创建游戏并安装 Fabric、Forge、LiteLoader、OptiFine 流畅的动画设计 支持多线程（速度非常快） 详细了解 🙃补充：Java下载链接Java都到17啦"},{"title":"今年国庆","path":"2021/10/06/2021国庆/","text":"国庆假期的一些事 😧国庆期前回了趟学校国庆假期有7天，回到家发现数学老师在班级群里发的作业和在学校说的不一样，这就导致了我没带一些完成作业必要的东西。刚刚回到家，就得知必须要再去一趟沁阳取东西，这种事情发生，是个人都会生气且感到无力。 所以干脆在我去完成旅行作业时顺便去学校取东西。 到了10月6日，我决定去离家较近的晋冀鲁豫解放军第九纵队红色教育基地看看，顺便去学校取东西。 到了学校，发现学校已经在安装空调了，我们班里竟然有人！我的天，也有人来取东西了？结果不是，是杨绍华在班里写作业，我很是惊奇，以为他是来补课的，也没有在意。我到了座位上取东西，他问我：“什么时候开学的？”我回答：“明天下午6点。”他突然很震惊：“明天？！我以为是今天！” 补充： 杨绍华是初三下来的，因为个人身体的一些原因，初三休学了一年。来到初二后上课也是断断续续的，经常回家。但他是一名爱学习的学生，初三考过年纪前十。 据卫老师说是因为他压力太大，身体经常出现一些状况，所以经常回家调养。 好家伙，这是闹了个乌龙！ 😀去红色教育基地喽我取了东西，向红色教育基地进发。 到了那里，其实也没什么，由于当天下雨，没有开门… 不过我还是拍到了一些图片（哈哈哈，没关水印，小米5X瞩目）： 👌7天，我如何安排我的假期🤔前言国庆到了，学校出乎意料地给了7天放假时间，这真的很棒！ 我回忆起了上一次国庆假期：上一年的我浪费了太多时间，作业补到深夜，要背诵的知识也没有背，考试一塌糊涂。 这一假期我要好好规划，现在我比较理智了，有一定管控自己的能力。 🏋️第一天就玩！ 首先要做的肯定是放松自己！ 不过也可以适当写一些作业，但一定别写太多，先放松。 🙋第二天规划开始规划自己的假期： 把你的作业（基本任务）列到OneNote 然后思考你还需要完成的任务（自我提升），他们不是必要的，但也对你有一些帮助 最后是你的娱乐计划 选择OneNote是因为它不约束，格式随意，且多设备同步。 当然，你也可以选择Flomo、印象笔记等等工具 To Do 计划在你的To do清单上列出今天的任务，无需设计截至时间。 然后对它们分类，这里参照GTD工作法。 Todo清单我推荐微软的Todo、滴答清单，或者一张随身携带的白纸，它们都可以很棒地计划你的一天 任务的完成首先应该积极完成每天的必要任务，比如有时限性的作业。 然后还要适当超额完成任务，相信我，这样很棒！ 不能一气完成所有作业，一口吃不了胖子。 😪第三天这一天我们需要尽可能的完成任务，增大任务配额。 因为我们希望的是4天完成国庆作业，所以明天就是最后期限了。然后留下一两天来调整、复习。 当然了，大脑也是需要一定的休息、适当的奖励的，这里推荐使用番茄工作法，这一工作原则十分科学且合理。 👿第四天突发事件：要去看外婆 作业时间 －4——6小时 哈哈哈哈 惨 👀第五天行了，这个假期算是给我安排废了，这天作业还没有写完 👅第六天终于写完了 然而还有小尾巴 还没复习，很多东西还没背啊啊啊啊！ 🏫第七天下午回学校，准备考试 今天背一些东西吧。 🔑我的假期结束了"},{"title":"纯纯写作：安卓端最棒的写作应用","path":"2021/10/04/纯纯写作/","text":"纯纯写作本身和它背后的一些事 😀前言这篇文章可能和以往一点点不一样，你现在看的是我们的全新定位：Pure类型的文章，Pure相比普通文章，更多的是思考，是深度。 朋友们，写这篇文章我写得可以说是底气十足，因为我通过播客这个小众渠道了解到了开发者的很多思想，所以说这篇文章可以说是对纯纯写作及其开发者的深度解构。 这篇文章不会对纯纯写作的功能有过多评价，我想和你聊聊纯纯写作背后的一些事。 ⁉纯纯写作为何物纯纯写作是一款在安卓端有一定知名度的写作、记录APP。口号是和理念是：不丢失 🌵详细介绍付费系统这款APP有付费系统，不过不付费也完全能用。 我接触纯纯写作是在2019/2019年期间，当时没有手机端写作的需求，所以用了没几天我就删了，当时的高级版好像只要5元还是9元，但是当时功能少，感觉不值，但没想到这是一款“理财产品”。后期有了很多功能，非常值。而现在纯纯写作的高级版价格已经飙到了100多元，哈哈。 为什么会有纯纯写作纯纯写作的作者是“微软三剑客”之一——Drakeet。 其作者喜好在手机端写作，曾在少数派播客中提到：灵感转瞬即逝，来不及打开电脑，你第一时间想到的肯定是手机。但是作者曾经在手机端写的文章遇到了丢失的情况，于是这让作者萌生了自己开发一个写作工具的想法。加上作者收到过“字里行间”的邀请，曾受邀去协助开发一款编辑器，但由于安卓的种种限制，开发完成后的效果不尽人意，但是由此作者也积累了非常丰富的经验。 纯纯写作的优势安卓端的编辑器大致有两种类型：系统自带和第三方开发 但是系统自带的体验非常差，纯纯写作作者称“还没有IOS的十分之一好用”，而自己写一个第三方的又会导致性能很差劲，且安装包体积增大，微软的Word就是一个很好的例子。这也是为什么安卓端一直没有出现近乎完美的编辑器的原因。 但是纯纯写作做到了，它在系统编辑器上做了很多的魔改和优化，达到了安卓端数一数二且近乎iOS的完美体验。 纯纯写作流畅且美观，作者始终走在安卓的最前沿，纯纯写作早已率先支持安卓12 beta版且移植了很多的先进特性进纯纯写作，纯纯写作率先适配完美状态栏、沉浸虚拟按键、深色模式、MD、MD2等等先进特性。 我们都知道安卓打开APP后会先加载服务，再加载界面，而iOS则是先加载界面后加载服务，所以感觉上iOS比安卓快很多。但纯纯写作做了很多功夫，保证它的冷启动足够快，让你点开即可记录，不让珍贵的想法流失。 🎇入了！我强烈建议大家入手一个纯纯写作的高级版，这东西只会越来越贵。其实你要明白一个理念：你用的这个软件，你只不过是在试用。当你觉得这软件不错时，你付费了，这才是开始了正真意义的使用。 纯纯写作作者说过：”遇到喜欢的东西就把它买下来，钱并不是真的花掉了，只是换一种方式，陪伴在你身边…”😋 🚗纯纯写作最近的进展作者表明电脑版正在完善，不再是作者一个人开发（精力有限），作者找了另一位精通电脑开发的小伙伴一起做，希望纯纯越来越好。 💘作者的痛我搜集了很多资料，以证作者清白。 纯纯写作旧版遭人破解，作者之前说：纯纯写作不可能被破解。而这次的破解性质不同，你是APK层面的，而是直接使用了XP框架劫持Hook。虽然后台早已报错，但作者没有在意，直至问题猖獗。 破解者正是：大圣净化 这是一款走在被起诉边缘的APP，可以净化广告、破解应用。 于是便触发了大圣和作者的冷战。 二人本是微信好友，且互相拉黑了。 作者给纯纯加入了Root扫描和XP框架扫描，并开始要求用户强制更新纯纯写作。 后来大圣下架了此功能，并关闭了VIP的售卖，并承诺1年后，大圣净化所有会员全部失效。此事算是有了个终结。 作者其实人很好，曾经有位酷安用户，学生党由于钱不够去联系开发者，希望5元购买纯纯写作，开发者直接同意。这样的善事开发者已经不是第一次了。 但后来的种种，让开发者的心境发生了巨大的改变。 作者的改变也引发出我们对于中国消费习惯的思考… 👵最后最后我希望你可以入坑一个纯纯写作。 哦对了，纯纯写作是安卓端最棒的Markdown编辑器，这篇文章全部由纯纯写作完成编写。 👍拓展推荐一派：与钟颖聊盗版：2019 年的地下黑产，居然都在这么玩儿 一派：碎片信息的收集与管理 📕参考资料 一派：你想在 Android 上完成一次纯粹的写作，先得确保稿子不会丢啊"},{"title":"上手实操：从Fluid到Icarus再到Nexmoe","path":"2021/10/03/换主题/","text":"闲来无聊，给Hexo博客换个主题 🎨前言今天无聊，看着这平淡无趣的博客主题，突然想换个主题 我突然想起了这个大佬 又想起了它的博客网站： 哎？好像还蛮不错的啊 所以我决定：换！ 🚗从Fluid到Icarus先安装它 1npm install -S hexo-theme-icarus 然后启用它！ OK，搞定了。 这么简单？配置文件呢？ 不管了，先本地预览一下！结果… 哈哈，貌似缺了个依赖包，装！ ？？？不对啊！怎么长这个样！ 然后我又到他们的Github上研究了一下，进入了官方文档。所以我们要新建_config.icarus.yml文件，哈哈，原来已经有一个了 那我们就简单配置一下它，差不多了。 还是很简单的。 但是！你可以看见我们的评论插件可以自动适应深色模式和浅色模式（写文章时我的电脑处于深色模式），但博客站不行！并且这个主题里，我的头像显示也不正确！ 再换！ 🚍从Icarus再到Nexmoe这个其实就很简单了，因为它是国人开发，配置文件是中文的，并且我之前已经安装过Nexmoe了。 来啊，我们先看一下@折影轻梦（Nexmoe主题制作者）的博客 很不辍啊。 但是它也没有完美的暗黑模式支持，写到这里，突然想放弃，要不回去养老？ 不行！ 理由很简单：那个主题我用腻了！不管它，我们继续整！ 最后总算差不多弄好了。 但这个主题就挺邪门的。它的分类不是嵌套的，多个分类竟然会是自成一体，没有嵌套，这点很难受。"},{"title":"一些想法","path":"2021/09/25/想法/","text":"写博客，真的，很累 🤓我想说额，写个博客站其实不是一个容易的事，这需要时间和精力，我是初二学生，人在覃怀，时间很紧（甚至2021年中秋没放假…），压力很大，每周能从百忙之中抽出一点时间写一篇文章就算奢求了…但是我每天都会有新点子，新想法。我想记下来、分享出去，但不久我就会忘记我的想法。 每当周末放学回家，我看着挤满安排的GTD计划本，又一想我的博客还没更新，且还有很多像写的东西没有写，我就会异常烦躁。 我希望以后自己可以慢下来。 慢下来… 希望不要那么急，希望自己有点耐心。 或许我们要思考的是：是否我们真的太快了？！ 我希望能把更新速度放慢，把质量提高。 所以大家只要每月看一次RSS订阅，或者说翻一翻你的邮箱，看看这个急躁的学生是否更新了文章就行了。更新了就看看，图一乐，增技能，是吧？ 😀还有我想把我的灵感记在这里，防止忘记它们，这些文章我会按顺序陆续补上。 📝以下就是我的灵感 半份隐私捍卫指南 沁中见闻 我来到了大沁中 打疫苗 餐厅真不辍 原班级的相聚 寝室说话一窝端 完蛋了！语文小测 脚又崴了 怎么是这个物理老师！ 老卫还是那个老卫 Nexmoe主题使用指南及如何写博客 吃个月饼还“杀人” 快生活？不妨慢一点 😜再来个有意思的事你猜怎么了？！ 我这篇文章写完了，但当时忘记保存了，没想到Typora也没有提醒我保存！ 结果就是——文档丢了！气死了，又得重写。 我想：它有没有自动保存功能啊！防止再丢文档！ 然后我就去看Typora的设置，真有！但是吸引我的是下面那个按钮：寻找丢失的文档。 没想到，真找到了！！！ 厉害啊！"},{"title":"知乎月饼事件及对“低糖”的思考","path":"2021/09/25/月饼清除大V/","text":"知乎月饼清除“大V” 😱这是发生啥了？！"},{"title":"诚信","path":"2021/09/24/诚信/","text":"随便唠唠诚信 引入诚信是立身之本。一个人如果失去了诚信，将在社会上没有立足之地。诚信是中华民族的传统美德，是社会主义核心价值观的重要内容，是做人的根本。古往今来，人们写出了很多关于诚信的名言和故事，由此可见诚信的重要性。 那么，何为诚信？诚信是由两个字组成的：“诚”与“信”。“诚”即真实，实在。“信”则不仅要求人们说话诚实可靠，切忌大话、空话、假话，而且要求做事也要诚实可靠。而“信”的基本内涵也是信守诺言、言行一致、诚实不欺。简单说诚信就是一个道德范畴，是公民的第二个“身份证”，是日常行为的诚实和正式交流的信用的统称。 诚信的故事那么，我给大家分享一下诚信的小故事。 曾子杀猪曾子是孔子的学生，他博学多才，且十分注重修身养性，德行高尚。一次，他的妻子要到集市上办事，年幼的孩子吵着要去。妻子不愿带孩子去，便对他说：“等妈妈回来将家里的猪杀了给你吃。”孩子听了，非常高兴，不再吵着要去集市了。这话本是哄孩子说着玩的，过后，妻子便忘了。不料，曾子却真要杀猪。妻子说，“我是骗他的啊，你怎么当真呢！”曾参说：“孩子是不能欺骗的。孩子小，只得学习别人的样子，尤其是以父母作为生活的榜样。今天你欺骗了孩子，明天孩子就会欺骗你、欺骗别人。“ 商鞅的立木为信春秋战国时，商鞅在主持变法。当时处于人心惶惶之际，为了树立威信，推进改革，商鞅下令在都城南门外立一根三丈长的木头，并当众许下诺言：谁能把这根木头搬到北门，赏金十两。围观的人不相信如此轻而易举的事能得到如此高的赏赐，结果没人肯出手一试。于是，商鞅将赏金提高到50金。重赏之下必有勇夫，终于有人站起将木头扛到了北门。商鞅立即赏了他五十金。商鞅这一举动，在百姓心中树立起了威信，而商鞅接下来的变法就很快在秦国推广开了。新法使秦国渐渐强盛，最终统一了中国。 小结由此，我们可以看出诚信的重要性，那么如果社会没有诚信呢？ 社会失掉了诚信社会必将失去基本的公平正义，而且人与人之间也就不会有基本的信任，失去了信任人本身存在也就失去了道德的支撑，没有了道德我们也就失去了生存的基本的进化之根！那必将是人类的灾难。 守住身边的诚信所以我们更要诚实守信，答应别人的事说到做到，不欺骗他人！ 🙌不装了这玩意是老师要求写的，我就顺手分享到博客上吧。 哈哈，你们不用说，我也觉得这个写的很烂，因为都是网上的东拼西凑的啊！"},{"title":"什么！竟然可以用电邮订阅本站！","path":"2021/09/06/电邮/","text":"叮！这是你的今日份邮报！ 就是这样的，和标题一样 订阅地址 文章很短… 貌似国内访问不是很通畅，不过也还好啦！"},{"title":"Win 10完美深色2.0","path":"2021/09/06/Win完美深色2/","text":"我之前写过一篇让Windows自动切换深色和浅色模式的文章，在那篇文章里，我们使用的是计划任务，但是它还是有缺点，这回舒服了。 🖊前言我之前写过一篇让Windows自动切换深色和浅色模式的文章，在那篇文章里，我们使用的是计划任务，但是它有一个缺点：比如说我把自动切换深色的时间设在18:00，那么如果我在18:00没开电脑，而在18:00后开了电脑，那么就不会自动切换深色模式，浅色模式的切换，缺点也是如此。 那么有没有更好的方案？ 🤜第一式：Windows-Auto-Night-ModeWindows-Auto-Night-Mode是一个在Github上开源的软件，意味着纯净、免费、不作恶。 安装界面多语言可选，但是没有中文，不过不用担心，安装完毕后，主界面是中文的。 你可以通过自定义时间或者日出至日落来自动切换深色和浅色。 点击应用程序，可以进一步自定义 最棒的是，它支持切换壁纸！我可以在白天使用浅色壁纸，在夜晚自动切换为深色壁纸！ ⚔第二式：Twinkle Tray如果你是笔记本用户，你可以按动笔记本上的亮度切换，以此调整亮度 但如果你是台式机用户…是的，我知道你不想打开显示屏复杂的菜单去调亮度，所以就有了Twinkle Tray 和Windows-Auto-Night-Mode一样，它也在Github上开源。 首次使用，它会躲在你的托盘里。当你把鼠标移到它的图标上，再滚动滑轮时，电脑屏幕的亮度也会跟着改变。 点击托盘图标也可以调亮度。 它还支持根据时间自动切换显示屏的亮度 当然也少不了快捷键控制亮度，笔记本般的体验！ 值得一提的是，Twinkle Tray对多显示器有着较好的支持。 📕总结有了这两款应用，你的电脑基本就可以实现完美的Dark Mode了！ 🏠资源下载Windows-Auto-Night-Mode Twinkle Tray 📃参考资料Windows-Auto-Night-Mode Github 想让Windows更好用，来把这几件事做好"},{"title":"来免费搭个博客站","path":"2021/09/04/搭博客/","text":"上！一起搭网站！ 📖前言没有错，没有错！MaxLen来教大家搭建博客站了！不需要任何编程基础，人人都可以有一个个人网站！ 本教程主要讲的是Hexo，其它工具也类似，部署平台是Github。教程适用于Windows端，利用手机建站请另寻高明（也不会有人在手机上码字吧）。 🔧准备我们需要三个东西： Node Git Github账号 如果没有Github账号请注册一个~ 只不过啊，需要注意：以后你网站的网址就是你的Github账号名+github.io 所以注册的时候建议简短一些，并且好记一些，比如说我的Github账号就叫“qyxyyds”，哎~是不是很好记。 如果你的网络环境不能访问Github，请自行寻找访问的 办法 魔法（WinXray是个很好的电脑工具） 📦Hexo的配置简单配置新建一个文件夹，就叫它blog 然后我们打开CMD（有PowerShell就用PowerShell）输入这样的命令： （**下文中为了方便，我们一并把CMD和PowerShell叫做终端**） 1npm install -g hexo-cli 进入刚刚新建的文件夹（也就是blog） 按住Shift，再按鼠标右键，选择在此处打开终端，依次执行以下指令： 1234hexo init mkhexocd mkhexonpm installhexo s 注意：在执行第三条命令的时候可能会这样 你不用慌啊，我是个过来人，当年我也是个小白，啊。这个的意思是说你的电脑缺mac环境，这玩意无关紧要，没事，不影响。 然后在浏览器里输入这个网址：http://localhost:4000 然后它应该会是这样子的 这就是你网站的样子。只不过还没完，这个网站目前还只有你一个人可以访问。待会啊，我们还需要给它部署到Github上，让所有网民都能访问。 好看的主题哎？你觉得网站怎么样？是不是很丑啊？ 这时候就要说到主题了！这是Hexo的一大优势，有着丰富的主题生态。 主题这个东西呀，Hexo官网有三百多套，好看的就拿几套，持续维护的少之又少。 我也就给你们捡着那几个好看且还在维护的讲讲。 但由于时间和篇幅啊，咱今天先说一个主题——Nexmoe 他们制作团队也给出了Demo，感兴趣的可以看一下什么效果 行，啊~不多废话，咱们开始。 首先，把刚才运行的终端关掉，然后再在mkhexo文件夹里按住Shift+鼠标右键，在此处打开终端，依次执行以下指令： 12npm i hexo-theme-nexmoenpm i --save hexo-wordcount 执行完毕之后，你的文件夹里应该有这些文件（图标不一样没关系）： 然后我们需要编辑config.yml文件，你可能会问：“不对啊MK，这是yml，不是txt，这咋编辑啊?” 哎~作为过来人，我告诉你：你去下载一个HBuilder（或者VS Code，NotePad++都可以） 不要自作聪明用记事本编辑（我是逊，之前我用记事本，后面出了一大堆问题） 咱把这个文件打开啊，然后你往下翻翻，你找找，在一百来行的位置有个这玩意儿 咱们把它后面的landscape改成nexmoe，然后点一下保存，点完保存就能把这个关了 然后你再在终端里输入： 1hexo s 浏览器打开 http://localhost:4000 看看，看看啊，是不是不一样了？ 剩下的站点配置交给你们自己琢磨了！ 可以参考这两份资料： Nexmoe主题官方教程文档 Hexo官方教程文档 整完之后记得在评论区交作业哦！ 🖱Github的配置我们打开Github，新建一个仓库 仓库的名字有要求：它必须是你的Github用户名+github.io 比如说我的Github账号名是qyxyyds，我的仓库名就叫qyxyyds.github.io Ok，新建完成。 网上的Github搭网站教程普遍都是用git+ssh部署，但是我们不这样做，我们来整点邪门的： 下载并安装GitHub Desktop客户端 在Github Desktop里登录你的Github账号 我们选择克隆仓库 然后我们回到终端里，输入： 12hexo chexo g 然后你会发现mkhexo文件夹里又多了一个文件夹，叫public 我们把这个文件夹里的东西删完，让它变成空文件夹 然后我们打开Github Desktop 选择URL 第一个框框如果里面有内容的话就不用改，如果没有内容我们就需要把仓库（就是那个我们之前新建的仓库）的git地址复制下来，填进去 然后在Local path里填那个public空文件夹的位置 点Clone就行，稍做等待，然后会进入一个这样的界面： 然后我们回到终端，输入： 12hexo chexo g 然后你的Github Desktop就发生了神奇的变化，我们接着这样操作： 再点击这个： 稍做等待… 完成之后回到浏览器，刷新一下你的Github仓库 看见了这些文件了吗？恭喜你！部署完成了！ 再检查一遍Github Pages是否开启 现在你就可以访问自己的网站了！它的网址是：你的用户名+github.io 比如说我的用户名是qyxyyds，那我的网站地址就是qyxyyds.github.io 🛠总结怎么样是不是很简单？ 恭喜你有了自己的网站！ 写这篇文章真的很不容易，花了我2个小时… 其它的配置当成作业，整完之后在评论区交作业啊！ ✒参考资料Nexmoe主题官方文档 Hexo官方帮助文档 Github+Hexo搭建个人网站 超详细Hexo+Github Page搭建技术博客教程 解决Gridea同步失败问题 Hexo最全搭站教程 Nexmoe主题Github开源主题"},{"title":"出现了！RSS！","path":"2021/09/04/rss/","text":"Rss这个老家伙又复活了 👏关于RSS的喜讯现在您可以使用RSS订阅我的博客啦！ 🤔如何实现因为本博客基于Hexo，Hexo已经有比较成熟的RSS插件，所以我们直接选用hexo-generator-feed 在博客目录下打开终端，输入以下内容即可安装插件： 1npm install hexo-generator-feed --save 打开博客配置文件_config.yml，最底部输入： 1234feed: type: atom path: atom.xml limit: false 然后我们去修改themes，打开themes的_config.yml，在最底部输入： 1rss: /atom.xml 搞定，你的RSS地址就是“你的博客域名/atom.xml”"},{"title":"IPhone13支持卫星通信？我觉得你想多了","path":"2021/09/04/IPhone13卫星通信/","text":"到时候发布会结束如果有卫星通信别打我脸 👄网传信息： 美国CNET科技资讯网站9月1日称，天风国际证券分析师郭明錤预测，即将发布的iPhone 13将支持低地球轨道卫星通信连接。“即使在没有4G或5G网络的环境下，用户只需打开iPhone 13的卫星通信链接，就通过手机搭载的卫通模块来通话和接发消息。”他还透露，最有可能与苹果公司合作的卫星通信公司是Globalstar，该公司是专注于提供高速互联网和其他服务的卫星网络企业之一，在近地轨道上拥有24颗卫星。号称有实力同SpaceX公司的“星链”卫星星座分庭抗礼。 👀可能吗？先说结论现在网传普遍都是相信，我倒是觉得不大可能 从这个技术本身来讲卫星通信好像看起来离我们不远，经常在电影里出现，但你要知道： 接收卫星频段很简单（即GPS），但你要发射卫星频段比较困难 你回忆一下你用GPS的时候：是不是必须到室外才能接收到信号？ 再回想一下电影里：是不是卫星通信的手机都像块“砖”。 并且手机想要发射频率是需要很多电量的（苹果挨打吧你，就是不愿意把电池做大！） 再谈谈基带咱们再来说说这个来自高通的“X60”基带，据说这个会是IPhone 13用的通信基带 但这个基带支持卫星通信？ 抱歉，目前网传的是：X65支持卫星通信 但在我看来：X65卫星通信也不太靠谱，原因上文也说了 还有报告的不专业性再说这个报告里面谈到了：可与“SpaceX”公司分庭抗礼 乖乖，你知道星链是什么吗？ 那玩意在中国是犯法的，在外国也只是给无法上网了偏远贫困地区用的。 也离不了苹果本身的原因再说，IPhone之前拜英特尔基带所赐，地面通信还是个问题呢，就想搞卫星？ 💥还有一些有趣的事害，当这个报道爆出的时候：卫星通信的股票竟然涨了! 看来苹果的影响力还不小啊！ 📕参考资料iPhone 13能直接卫星通信？ 卫星通信 苹果将推出黑科技？iPhone13或支持卫星通信美股合作商一度暴涨60%（附股）"},{"title":"那些好用的CDN图床们","path":"2021/09/03/图床/","text":"玩Hexo博客必不可少的当然是图床了！ 👍站长啦图床别小看它，它内置了很多大厂的图床API哦！ 内置图床一览： 头条图床 腾讯图床 阿里图床 搜狗图床 58图床 华为图床 搜狗图床 侠聚图床 京东图床 怎么样？强不强？ 💪遇见图床单张最大10MB，最多同时上传100张 ❤ImgURL图床Max个人比较喜欢的一个图床，游客每日最多10张，单张不超过5MB，支持Ctrl+V上传 🐖路过图床图床界大佬，可能是最知名的免费图床 全球CDN加速, 支持外链, 原图保存, 最大单张支持10 MB 📕资源地址 站长啦图床 遇见图床 ImgURL图床 路过图床"},{"title":"Windows应用商店的代替方案","path":"2021/09/03/代替WinStore/","text":"滚！Windows Store！ 📘引入什么鬼？Windows应用商店？你还敢用这玩意？俗话说：微软的东西不能碰，但是Windows自带的应用商店可以说是诚意满满（主要是因为里面有很多UWP啊）资源比较丰富，并且里面的UWP大多数轻量、纯净、好用。 那你为什么要抛弃它？哎，那当然是因为Windows的自动更新啊！自动更新关闭后，商店就废废的啦！ 那我该怎么办？你别急，这篇文章就是解决这个问题的。 👂Store RG，不错的镜像站用法介绍 整个网页界面十分朴素，吼吼~ 是不是一目了然？没错，这玩意小白一看都会用——输入链接即可 但是软件们还需要一些依赖库，下面我们慢慢讲~ 实例以这款HyPlayer为例 只需要复制它在Windows Store中的链接 就可以抓取到安装包了 哎！别走啊，还没完呢！ 这些UWP是有各自的运行库的，这个网站也一并会把他们所需的运行库抓取下来，对应自己的电脑版本下载就好了哦 资源地址Store RG 👅总结虽然需要下载运行库，很不方便，但也是一种目前已知可用的较完美代替了。 否则你就给我开自动更新吧！ 😎还有一个骚操作虽然一些应用在Windows应用商店里下架了，但只要你知道它的网址，你就依然可以下载哦！"},{"title":"让Windows 10自动切换深色模式","path":"2021/09/02/自动深色/","text":"自动任务so easy 🚗引入Windows 10中，你可以手动在设置中切换浅色or深色模式，但不能自动切换 Windows 10中，还有一个夜间模式，但它并不是人们所理解的“夜间模式”，我更愿意称他为“护眼模式”。 那有没有办法让Windows 10自动切换深色模式呢？有两种方法。 ⏲这个被你忽视的小功能：计划任务二分之一 打开任务计划程序，如果你不知道它在哪里可以找到，你可以使用Windows+S打开搜索找到它但这里我们依然提供它的路径：控制面板 &gt; 所有控制面板选项 &gt; 管理工具 点击”创建基本任务” 在启动程序中，输入reg.exe，而参数则输入： add HKCU\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Themes\\Personalize /v SystemUsesLightTheme /t REG_DWORD /d 0 /f 唉？你以为好了？其实还没好哦！这只是切换了Windows为深色，而应用还不是深色哦，依法炮制，我们再创建一个计划程序，在启动程序中同样输入 reg.exe，参数输入： add HKCU\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Themes\\Personalize /v AppsUseLightTheme /t REG_DWORD /d 0 /f OK，至此，自动深色部分已经完成，接下来我们还需要让它自动变为浅色 其余的二分之一我们依然依法炮制：在启动程序中同样输入 reg.exe，参数输入： add HKCU\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Themes\\Personalize /v SystemUsesLightTheme /t REG_DWORD /d 1 /f 再创建另一个：在启动程序中同样输入 reg.exe，参数输入： add HKCU\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Themes\\Personalize /v AppsUseLightTheme /t REG_DWORD /d 1 /f 二分之二至此，自动开启or关闭深色模式的第一种方法就结束了！ 更加快速简单的方法：Windows-Auto-Night-Mode 这玩意是开源的，也就是说它可以保证绝不耍流氓，代码透明、人人可见，绝无病毒！ 值得一提的是：MaxLenの博客站和随机波动博客站也是在Github上开源的哦！ 这个应用在此就不多赘述，详见请看少数派的测评报告 下载地址：Github （国内直链稍微困难） 图片来源：少数派 👍总结OK，这篇教程到这里就结束了，但它们并不完美无缺，想要无割裂且完美的体验，只能等待微软官方的跟进。这个功能能否在Windows 11正式版上实现？以微软的尿性，我觉得很难。"},{"title":"卡巴斯基KES，你好丑，我要让你变成萌萌的卡巴酱","path":"2021/09/02/KES卡巴娘/","text":"嘿嘿嘿，自己动手，丰衣足食！ 🦄适用版本 测试版本：KES11.6 听说KES11.7的UI会大改，所以可能只有11.6能用了啊 📚修改方法OK，直接扒开KES的安装目录，关闭卡巴斯基自我防护，退出卡巴斯基！ 顺着skin摸下去，结果发现neutral中没有我想修改的文件，还有一个resources.zip没有爆破 最后瞄准了resources.zip 哈哈，果然在这里面 找到前人留下的卡巴酱，用画图覆盖一遍！ 啊啊，卡巴娘真的好可爱！萌出血！(/▽＼) 完成啦！效果如下！ 🚗美化文件下载PS：使用方法和美化文件我已经发到了卡饭论坛哦！"},{"title":"1582天，我与Emsisoft分道扬镳的故事","path":"2021/09/02/完整版放弃Emsisoft/","text":"有深度，很长 👋是时候离开并放弃 Emsisoft 了各位好，这将会是一篇我个人针对 Emsisoft 的抱怨与牢骚，以及 Emsi 这间公司最近所发生的许多负面消息与现况，因为文章写着写着结果变得相当的长，所以我决定改放在日志这边，先在这里感谢能看完的朋友。 首先大家肯定会疑惑为什么我会突然想要放弃 Emsisoft ?是什么原因让从 2017 年初拥护 Emsisoft 至今，曾推荐 Emsisoft 给不少人使用的我，会突然对 Emsi 这间公司感到极度失望甚至到了要放弃的地步 ? 答案是【诚信】。 当一间公司没了诚信，对于自己以往的承诺不再遵守， 并且将现有的用户视为草芥，相信再怎么忠心的用户也都会感到反感。详情请容我慢慢细说 ~ 😱我遇到了什么事情？大约在 20 多天前，也就是在今年的 8 月初，我的 Emsisoft 软件突然遇到了个奇怪的请求，也就是会时不时的跳出视窗，要求我重新验证我的授权码(KEY)，一开始我并没有理会，将视窗关闭后其实也没有任何影响，但几天后，弹窗次数开始多了起来，于是我在指示要求下， 重新验证了一次我的授权码(KEY)。 验证过程很顺利且通过了，但我的个人习惯是会再次做检查， 且软件正常不应该出现再次要求验证授权的要求。 于是我登入了已经许久没登入的 Emsisoft 的会员中心(Member Center)，却惊讶的发现我刚刚验证过的授权码(KEY)从我的记名下直接消失了。 虽然授权(KEY)验证通过了，软件在更新上也毫无问题，但授权码从我记名下消失显然是非常有问题的，于是我立刻透过电邮，将问题与细节状况，将问题反馈给了官方的技术支持电邮 (&#x73;&#x75;&#112;&#112;&#x6f;&#x72;&#x74;&#64;&#x65;&#109;&#115;&#105;&#115;&#111;&#102;&#x74;&#46;&#x63;&#x6f;&#109;)。，却没想到这是导致我被迫离开 Emsisoft 的原因。 是的，是被迫。 🤔我的授权是怎么取得的 ? 合法吗 ?这里就先解释一下我的 Emsisoft 授权是怎么来的。 首先简述一下 Esmi 以前曾经实施的奖励制度，Emsi 在 2017 年初的时候为了推广自家知名度，推出了所谓的推荐奖励，只要 Emsisoft 的使用者能透过自己的推荐连结，每成功推广一个人安装 Emsisoft 在系统上，推荐者就能增加 30 天的授权时间。 而就这么刚好，2017 年中旬的时候，WannaCry 勒索软件在世界各地肆虐，中港澳台也都是重灾区，恰好卡饭有篇评测文，将各家软件的库锁在 2016 年底，来测试杀毒软件遇到未知威胁时，能否有效防护系统。 而 Emsisoft 在这项测试中表现亮眼，恰好我当时也在 Emsisoft 的试用期期间，于是我在取得原作者同意后，将卡饭这篇文章，转载到其他论坛，顺便放上了我个人的推荐连结。 卡饭的文章连结 : https://bbs.kafan.cn/thread-2089134-1-1.html我转贴的连结 : https://www.mobile01.com/topicdetail.php?f=508&amp;t=5150528 没想到这篇评测文大受欢迎，我转贴到 Mobile01 的文章超过 30 万人次的观看次数。 且被再次转贴的次数多到数不清，还有几人因为我的推荐而购买了 Emsisoft，让我成功累积更多的推荐奖励，结果意外的我的 Emsisoft 推荐奖励累积，来到了惊人的 50 年左右，让我的授权有效期限来到了 206X 年。 在我惊讶之余，也担心我这样的推荐跟使用可能会让官方误以为我是滥用或作弊，于是乎我自己主动去联系了 Emsi 官方，并找到了当时的销售领导/经理(Salse Manager)，一位叫做 “ Thomas Ott “ 的人，这位 Thomas Ott 是当时负责 Emsi 所有授权、销售方面的领导主管。 这位 Thomas Ott 是位非常客气且有礼貌的人，对于我的问题马上就给予了答案，在看完我的叙述及提供的相关资料与佐证后，回覆中提到了对于我的成就感到惊讶，因为不是随随便便的人都能够让文章观看人数破 30 万人次，更别说以个人身分推广超过百人去试用软件了。 也因此这位 Thomas Ott 还特定跟我说明，他们内部特地为了我开了一次小小会议，讨论我的状况是否属于合法使用，是否要承认我的授权(KEY)合法性， 经过讨论，他们认为我使用上完全合法且依照他们的规则，所以没有理由拒绝我， 于是我正式且合法拥有了一个时间长得不像话的 Emsisoft 软件授权(KEY)。 在收到回信后我非常的感谢他，不过我也提出了个意见，我认为我的授权长到 206X 年实在不太可能用的完，恰好我又有桌上型与笔记型两台设备，于是我厚着脸皮提出了个想法，询问 Thomas Ott，Emsi 是否能允许我，将原先 206X 年，但只能用在一台设备上的授权，将时间缩减一半，但将设备数量由原先的一台，改为两台设备 ? 没想到 Thomas Ott 很快就给回应了，他表示 Emsi 非常乐意替我这么做，所以在我收到电邮回信当下，我的授权码就已经完成修改，从原先的 206X 年，变成 2030 年，但可以供两台设备使用。 下面这张撷图就是我与 Thomas Ott 的对话纪录撷图之一，官方肯定并证实我的授权合法性，并可使用至 2030 年 10 月。 图片中甚至还特地注明，为了避免未来其他 Emsi 客服误以为我授权是滥用，所以已经在授权系统旁边注记我的特殊状况，避免未来被误解、黑名单。 这里说一下 Thomas Ott 这位客服(销售经理)的印象非常好，除了态度非常好之外也非常贴心，我曾跟他反应过我收到他的回信后，都已经是台湾时间大约清晨的两三点了，常常因为这样所以我们信件往返之间都会浪费不少时间。 在得知这件事情后，Thomas Ott 主动告知他住在奥地利，而他习惯早上进办公室时先处理公务，下午才开始回覆客户电邮，但得知我的状况后，他特地修改他的工作流程，每天进办公室后先回覆我的电邮，之后才处理其他事情，这样我就能在晚上 12 点以前收到他回覆的信件。 这点非常让人感到贴心，如此重视服务，也难怪许多人，包含欧美地区的 Emsisoft 用户都赞美过 Emsi 的客服服务态度与质量很好。 🤯为什么我的合法授权突然被黑名单 ?以上时间都是在 2017 年，但我们把时间拉回到 2021 年吧，很遗憾的是， Thomas Ott 这位亲切的人在 2019 年的时候，因为个人因素从 Emsi 离职了，而授权方面的事宜则由另一位，叫做 “ Fabio Di Bari “ 的人在接手处理。 时间回到今年的 8 月初， 我遇到了文章开头时所提到的授权在会员中心消失的问题，当我将这件事情的详细经过与状况，透过官方的电邮反馈后，并不意外的，由这位 Fabio Di Bari 来处理我的问题。 但完全没想到这位 “ Fabio Di Bari “ 处理方式让我傻眼，他非但没有试图找出问题或询问我问题细节，也完全没有做任何说明，信件内只莫名其妙简单一句话，声称我的授权是违法滥用所获得，所以授权已全数被他 terminated (终结、作废、拉黑)。信件内完全没有做出其他解释或说明。 这让我非常的讶异，因为我的授权不但是合法取得，且也早已在 2017 年时，通过 Emsi 官方的认证跟保证，现在却在未说明、未查证的状况下直接把我序号作废 !?更何况这与我原先提出的授权从会员中心消失的问题，是毫无关联的 ! 由于我在突然毫无理由且未经查证状况下被黑名单，于是乎我立刻回信给 Emsi 抗议，结果回信给我的人依然是这位 “ Fabio Di Bari “。 当时我在信件内附上了当初我与 Emsi 官方(也就是 Thomas Ott) 之间的交谈纪录撷图，以证明我是正当且经过官方审核后认证的合法使用者，却没想到换来的仍是他的这么一句话 : “ 请你付费购买全新的授权并提供购买证明，否则将不再提供你服务 “。 这简直让我气极了，这家伙不但没试图解决我的问题，连我提出之前 Emsi 官方自己所做出的承诺跟相关证据也故意当作没看到，完全刻意无视也不提出任何理由，还大言不惭的直接要求我再花钱买新的，不然不继续服务了 !? 于是当我发现我跟这个人完全没有办法沟通时，我当下提出要求请 Emsi 的领导(manager)来处理我的问题，并对这位 Fabio Di Bari 做出投诉的抗议。 😡Emsi 突然翻脸不认人，背弃诺言且完全把客户当空气 ?Emsi 的客服部门领导(经理、customer lead)，之前都是一位叫做 David Biggar 的人在担任，他也是我比较熟悉的人，从 2017 年开始使用 Emsisoft 至今，许多软件使用上的问题、意见、Bugs 反馈，都是这位 David Biggar 在与我接洽，我们之间电邮的次数多到数不清。而这位 David Biggar 在我印象中也是个态度良好且负责任的人，许多问题反馈给他后， 都能很快、有效率的获得解决。 但没想到，我回信抗议并要求由管理层来处理后，将近 10 天过去了，我没有收到任何回应 !我的投诉就真的如这位 Fabio Di Bari 所说，Emsi 刻意不再回信或处理我的问题， 如同石沉大海，真的完全不给任何回应。 这让我非常讶异，因为就 Emsi 以前的对客户的态度及表现来看，他们非常重视客户体验，绝对不会让这种事情发生。 在迟迟没有收到回信后，我尝试了所有我所知道的方式，官方电邮、软件反馈功能、官方论坛私讯、官方网站的 Live Chat、Emsisoft 的官方 Facebook，要求能够与 David Biggar 这位 Manager (领导/主管)联系上，并解决我的授权问题，却全部都没有回应，而 Facebook 的讯息也显示对方已经看到并阅读过讯息，但就是不回应(已读不回)。我分别在 8 月 13 与 17 日，发了两封讯息到官方的 Facebook 上面，系统提示其实讯息都已经被读取， 但就是刻意不给任何回应。 😢Emsi 突然改变，背后可能有问题 !于是乎我开始查证到底 Emsi 发生了什么事，我从官方论坛发现不少端倪，一经追查发现，恐怕 Emsi 这间公司出现了翻天覆地的变化。 首先是官方论坛的撷图 : 从撷图各位可以看到 从 2021 年的五月底左右开始， 许多的文章、帖子都不再有官方人员出面回应， 大多数变成其他用户来志愿回答问题。 这点很不寻常，如果客服系统有正常运作， 绝大多数的文章都应该会有官方人员出面回应或协助，譬如撷图中的 “ GT500 “ 就是官方人员之一。 这位 GT500 虽然我不是很熟悉，但在论坛上交流过数次，至少我认为是一位合格的客服，对于客户提出的技术性问题也都能给予答覆或解决方案。 但奇怪的是这位 GT500 从五月底后就彻底消失在官方论坛上，于是我在官方论坛上提出质疑后，没多久就收到了来自官方论坛，其他的 Emsisoft 用户发来的私人讯息。 这位用户提到他跟我一样，对于 Emsi 近期的服务质量突然大幅下降非常有感，并且告知我，根据他查询，透过 LinkedIn(领英) 服务，找到了 GT500 的个人页面，他上面竟然显示七月后他已经不再是 Emsi 员工，目前失业中。(是离职还是被离职不得而知) 这让我相当讶异，GT500 应该算是 Emsi 有些年资的员工了，即使不是担任核心成员只是个客服，但怎么就这样(被)离职了 ? 于是乎我开始慢慢查找，发现论坛上有几个看过且活跃的官方帐号都消失了，这也代表着 Emsi 不只 GT500 ，而是有好几位的员工不是离职就是异动，造成服务质量大幅下降，也难怪官方论坛中许多使用者的求助甚至长达数个月没人回应。 此时我也注意到让我更心寒的，在 Emsi 的官网中，在自我介绍的页面里面有段文章是在介绍管理团队，以前 David Biggar 的名子一直都在上面，并标示为 Head Of Support(领导/经理)，但不知道何时，他的名子竟然被拿掉了， 换句话说，David Biggar 迟迟至今没能给我回应，也连系不上，恐怕不是被开除就是被调离了。 那现在客服领导/经理由谁接手呢 ?一查真是让人傻眼了，竟然就是这个 Fabio Di Bari 接手，现在变成了 “ Head Of Support “ ! 也许有人会问这位 Fabio Di Bari 究竟是何许人也 ?事实上我也不清楚，介绍中提到他是罗马尼亚人，在 2020 年的时候，曾有其他 Emsi 官方在官方论坛上提到，他还只是一个 “one of our sales representatives “，也就是说只是销售部门的其中一位职员(伙伴)而已。 但我们来看看 LinkedIn 上，Fabio Di Bari 他现在的自我介绍吧 : 他在 Emsi 的职位与工作内容是这么写的 :-——————- Head Of Support, Emsisoft, Feb 2021 - Present Responsible over the whole Support department and operations. Coordinates Emsisoft’s operations in harmony with Sales, Marketing and DevOps. Set targets and monitor individual and team KPIs and introduce efficiency in the productivity and optimization on the scheduling. Ensures workload is spread optimally between staff and shifts managing risks and responding to changing requirements. Defines training and development strategies for the support department and set guidelines and objectives for the group. Responsible and Accountable for people management and development through mentoring and coaching. -——————- 简单来说，这个 Fabio Di Bari 在 2021 年 2月，从原先的职员， 突然飞身成了整个部门之间的主管(领导)， 并拥有调整营销、策略、客服与开发部门之间的协调等等工作。 所以当我查证到这里，心里大概也有个谱了，为什么 Emsi 服务质量突然变得极差，过往的承诺与政策全数被推翻 ?部分的老员工与管理层不是被离职就是被拔除管理职位 ?为什么我一直无法联系到原先的客服支持部门的领导/主管来证明我的清白 ?为什么官方一直刻意忽视我提出的证据与记录 ?为什么所有的讯息都被已读不回，对于我的抗议与陈情置之不理 ? 答案显然很明显，原先有能力、服务好的客服都被消失了，自然服务质量就下降，申诉或抗议也都无效，自然也是因为问题转来转去还是同一批人在处理。 百般无奈之下，我在官方论坛上公开发表并指责 Emsi 现在的服务质量变差，对待客户无理，且毫无根据将使用者拉黑(黑名单)，我认为受到不公平的待遇。 而就在我发出抗议相关的文章出去后， 我就突然收到 “ 前任 “ 的客服部门的领导/经理(customer manager)， 也就是 David Biggar 给我的讯息，他明明十多天来都沒回应， 却在我公开提出指责抗议后，突然发讯息给我 ? 而这位 “ 前 “ 客服部门的领导/经理(customer manager)的回应也耐人寻味，只有简单两句话，首先提到我的授权突然被终止(terminated)，实际上是出自于 Emsi 的最高领导人，也就是 CEO 的意思。 Emsi 的 CEO 认为当初由推荐奖励所获得的授权码(KEY)，不管之前的政策或承诺是什么，都不应该超过一定的时间，所以给的指示就是将之前的承诺、活动奖励全都废除，不再承认，违背承诺也无妨。也因此最后这位 “ 前 “ 客服部门的领导/经理(customer manager)，最后给我的一句话就是 “ 现在一切以 Fabio 所说的为主 “。 🙃所以 Emsi 还有发生其他问题吗 ? 有其他 Emsisoft 用户感到不满吗 ?事实上还真的有，在 2021 年的 2 月，Emsi 恰好被爆出发生了资安事件，Emsi 公司的资料库被发现有资料外泄的情况发生，据报导指出有 14 位客户的电邮位置被窃走，但 Esmi 自己的事后调查报告指出除了上述资讯疑似被窃走之外，并没有其他损失，且事发当下立即做出了处置。 资安事件相关报导 :https://securityaffairs.co/wordpress/114444/data-breach/emsisoft-data-leak.htmlhttps://www.securityweek.com/antivirus-firm-emsisoft-discloses-data-breach Emsi 官方针对此次的回应 : https://blog.emsisoft.com/en/37707/incident-report/ 是不是这件事造成部分员工离职或被离职 ?是不是这件事造成管理团队与 CEO 之间有纠纷产生 ?是不是这件事造成董事会给了经营原团队不少压力 ?恐怕都不是我们一般用户能知道的了。 此外，在官方论坛上除了不少同为 Emsisoft 的用户都感到 Emsi 的服务质量大幅下降之外，我也意外收到了其他用户发给我的私讯，信件中的 Emsi 用户提到他认识了另一位 Emsi 的资深用户，她(对、是女生)平时在 Emsi 官方论坛担任测试员及志愿者，平常协助回应其他使用者的问题，同时也是软件的 BETA 测试者。 以下是发讯息给我的这位会员，引述她对目前的看法跟评论，我将一些回应原文简单翻译后的内文 : 她认为 Emsisoft 现在的负责人似乎与她和我以前打交道的人大不相同。 这是她在怀疑现在是否有人关心个人用户的另一种(委婉)说法。 她或多或少已停止在 Beta 版论坛上发帖……“因为没有意义”。 Emsisoft（曾经鼓励有技术头脑的用户成为 Beta 测试人员，并会向他们提供免费许可证） 近年来 Emsi 减少了他们告诉测试人员的信息量，并且越来越不接受测试人员发表的评论。 我从来没有要求过免费许可，因为有几次我对问题说得很直白， 我不想觉得作为一个免费用户， 我可能被鼓励不要批评。我想我宁愿保持完全的独立性。 很明显的，Emsi 连平时协助的 BETA 测试人员也开始漠视，不再正面看待这些人的过往的付出，难怪连资深的测试员也都开始感到心寒。 但事情就这样结束了吗 ? 其实不然， 更离谱的事情还在后面。 就在我收到 “ 前 “ 客服部门的领导/经理(customer manager)的讯息后，我在 Emsi 的官方论坛帐户就突然直接被封锁(Banned)了。 一样没有任何理由、没有警告、没有说明， 我就突然被禁止访问 Emsi 的官方论坛。 由于所有沟通管道都被官方刻意关闭了， 我还得靠浏览器的隐私模式 + 轻功工具，重新注册了新的帐户， 再次进入了 Emsi 官方论坛。 我使用新帐号，用非常客气且有礼的方式询问关于原帐户的问题，并询问是否有机回能取回我的帐户，然而官方的回答，就是直接再次将我的新帐号封锁(Banned)， 即使我没有任何违规。 -——————– 但这还不是最可怕的，在相隔了超过 24 小时之后，我靠浏览器的隐私模式 + 轻功工具，在官方论坛却看到我无法置信的画面。 我原先在 Emsi 官方论坛的被封的帐户(KevinYu0504)竟然显示的是 “在线上”，点击我帐户名称后，系统显示最后活跃时间为 10 来分钟前 ! 这就让人感到匪夷所思甚至到让人恶心了，我帐户已经被封锁超过 24 小时，我是没有任何方法可以使用我帐户的。 但为什么我帐户却是在线上且最后活动时间是还是 10 来分钟前 ? 有谁在使用我的帐户吗 ? 再次检视 Emsi 官方论坛上我的原帐户资讯，可以注意到最后浏览我帐户的是两位 Emsi 现任的员工，其中一位是将我授权码(KEY)拉黑的人，另一个则是负责管理 Emsi 论坛的员工。 我在官方论坛上的原帐户内，私人讯息很多，里面有其他会员跟我在讨论 Emsi 内部发生事情的纪录，有我跟前客服经理/领导 David Biggar 的交谈纪录，当然也包含了我对官方人员的无理态度的抱怨。 但现在我的帐户在我完全无法使用的状况下却能出现在线上，最后浏览我帐户的人又恰好是 Emsi 的高阶员工跟主管，这种巧合很难不让人产生联想。 🚶‍结论 ? Emsisoft 还能用吗 ? 值得信赖吗 ?首先就产品能力与效果这层面来看，Emsisoft 仍拥有目前数一数二的防护技术，在软件与技术层面上应该还是能有不错的表现，且从经营团队的介绍来看，技术大神 Fabian Wosar 仍然担任 Emsi 的 CTO(Chief Technology Officer) 职位，所以在软件的技术上应该还不至需要担心。 但从我长期的用户来看，Emsi 确实在近一两年左右鲜少对于一般个人用户端有做出让人耳目一新的变化，反倒是不断着重在企业、远端方面的技术与改进(甚至广告跟宣传)，似乎确实是不再注重一般个人用户的市场。 恰好之前卡饭论坛的 yiohar 相当的热心，向 Ashampoo 厂商询问事情的时候，得知 Emsi 已经停止 OEM 的业务，不再接受给其他厂商来 OEM，并透露出 Emsi 已经将经营重心转向商务 (Business) 的部分，对比目前 Emsi 的所作所为跟状况，可信度很高。 相关讨论 :https://bbs.kafan.cn/thread-2214455-1-1.html 但就服务层面来看，那就是完全不及格，甚至根本就是提油救火。先不论不少员工消失或离职导致服务质量下降，连最基本的承诺与规则也都无视，说改就改、说变就变，这对任何人或消费者来说都是没保障的。今天他答应你了，明天就反悔，且还没得申诉，也没人能维权，信赖与诚信荡然无存。最后甚至恼羞成怒，毫无理由的封锁了我，眼不见为净。 在看过我这样被官方 “ 对待 “ 后，你还能对 Emsi 现在的管理团队有信心吗 ?所以就结论来说，我个人目前认为 Emsisoft 并不合适一般个人用户使用，完全不推荐。 不只是因为厂商变得没有诚信、食言、政策反覆之外，公司突然出现人事上的异动，将以往的政策都推翻、无视之前的承诺等等，不经让人怀疑是经营上出了什么大问题，且连管理现在都是乱七八糟。 至于已经购买或者授权时间还没到期的用户我觉得也不须担心，至少 Emsi 短时间内还不至于倒闭消失，软件的更新与使用上也都很正常，只不过未来几年 Emsi 会变成怎样就很难说，毕竟现在 Emsi 对我来说是一间没有诚信的公司，加上大多数使用者都有感售后服务质量大幅下降，对待客户的方式既鲁莽又无理，所以在考虑 Emsisoft 是否為值得付费的產品時，各位就要三思了。 ♥精选评论 Emsi 以前被称赞的其中一部份，就是官方与用户之间没有距离感， 顾客能感受到官方人员不再是冷冰冰的客服或机器， 有问题通常都能在第一时间反馈到正确的人上。 这也是为什么官方论坛往常都会有客服保持一定的服务水准。 但现在 …. 确实有点店大欺人的感觉了 把所有好的员工都炒了，只留下无赖 账号被拉黑也就算了，结果还要私自登录你的账号也太离谱了叭？？？？？ 出尔反尔，你给他推广产品，结果到头来竹篮打水一场空，什么离谱公司啊 难不成是CEO更换了？如果是这样，这个人真是个毫无底线的人渣啊！想了一下，自从特烂扑上台后，这个世界就好像变了一个样，西方人已经不再讲道德，可以做着无耻的事情仍然洋洋得意，连伪装都没有！ 应该是 CEO 的主意，而新团队的作法又极其粗暴，如果是好好跟我说明是 CEO 的主意，他无力改变，好好说明就算了。 但新团队的做法显然不是，先随便抹黑说你是违规违法使用， 翻脸不认人，甚至直接拉黑，才会让人这么不爽。 CEO 没变，同个人。但从背后人事异动跟单位领导都改变的状况来看， 显然不是 CEO 吃错药这么简单而已。 原文来自卡饭论坛"},{"title":"我们都在被流量反噬","path":"2021/09/02/我们都在被流量反噬/","text":"很有意义的一篇播客转录 转录自：科技乱炖 抖音上爆火了一位的“拉面哥”，还有“泡泡龙”猝死事件，这些事让我谨慎悲观，不禁反思：流量是否反噬了我们？ “拉面哥”的拉面每碗3元，坚持不涨价，就算物价贵也没涨过价。抖音博主“彭佳佳”曝光了“拉面哥”的这一事迹，“拉面哥”自此在抖音爆火。 “拉面哥”说，钱有的赚就行，做的都是街坊生意，我的拉面就是给旁边工地的工人准备的。但是大家都来拍“拉面哥”，拉面哥的生意没法做了，摊位前挤的水泄不通，这些人为了蹭流量，为了被平台推荐，这违背了拉面哥的初心，甚至有人追到了拉面哥家里求拍照。开始有人在拉面哥摊位边卖WIFI，运营商紧急加建了基站，这些都让拉面哥的生意没法做了。 最离谱的是有人在拉面哥摊位边抬棺材上坟，跪在拉面哥身边哭。 哗众取宠，走火入魔！ 著名抖音网红泡泡龙，29岁，体重320斤，以猎奇吃播闻名，因拍反诈视频劳累过度猝死。他天天从事高强度拍摄，其实早已有人提醒它注意身体，但为了曝光度依然继续拍视频、猎奇搏赞。 这是否成为了一条产业链？ 出名 积累流量 做广告 也许我们应该反思，如果没有猎奇向的追捧，是否就不会有那么多的网红为了所谓的流量挑战身体的极限，浪费别人的粮食，最终走到被捧杀甚至自我终结的穷途末路。 没办法啊，这就是他们的核心竞争力，但竞争力的保持肯定是会对身体有所损害。 大家陷入了一种流量焦虑，走火入魔地寻求流量。 但为什么会追求流量？答案是：变现。 如果不这样做，流量就会跑到别人那里去，开始逐渐更沉迷于流量的获取。 可以说每一个为他们点赞的人都是害了他们。 算法没有感情，但有核心价值观。那么什么样的东西会得到算法推荐？标新立异与越界的内容！也就是说：算法鼓励标新立异与猎奇。只要加了拉面哥字样的视频就会得到算法推荐，可以说平台有意无意之间给拉面哥们、泡泡龙们点了火。 平台为了流量不择手段，有流量就会有利益，互联网公司为了流量沉迷其中、无法自拔。 著名的流量漏斗理论印证了：10000个人看了我的视频，就一定会有3个人买我的产品。 所以流量至关重要。只要有流量就能变现，流量直接决定了一个公司的盈利。 视频创作者依附平台，为平台创造流量，从平台获得流量。平台给我流量，我用流量变现，开始“内卷”。但依附平台，流量也归于平台，视频创作者只不过是平台获取流量的工具人。 平台以各种形式鼓励用户不择手段地获得流量，在这个内卷的过程中，平台才是最大受益者，其次才是创作者。 我们都在被流量反噬。"},{"title":"Hello World","path":"2021/09/01/hello-world/","text":"Hello Hexo！ 这是MaxLen在Hexo上的第一篇文章！你可以选择删除它或者保留它，当你看见了这篇文章，说明您的Hexo部署完成！ 开始写作吧！"}]